Repository: lawrancej/logisim
Catalog: xlate/ru/resources/omegat-logisim-resources_ru-level1.tmx
Source language: en
Languages: ru_ru

source: Error while loading appearance element %s
ru_ru: Ошибка при загрузке элемента внешнего вида %s

source: Change Attributes
ru_ru: Изменить атрибуты

source: Simulation Randomness
ru_ru: Случайность моделирования

source: Unload Libraries
ru_ru: Выгрузить библиотеки

source: Show component tips
ru_ru: Показывать подсказки для компонентов

source: Plexers
ru_ru: Плексоры

source: Equal: 1 if A is equal to B
ru_ru: Равно: 1, если A равно B

source: Edit tools appearing in toolbar.
ru_ru: Редактировать инструменты панели инструментов

source: Comparator
ru_ru: Компаратор

source: TOTAL (with subcircuits)
ru_ru: ВСЕГО (с подсхемами)

source: Use Two-Input Gates Only
ru_ru: Использовать только двухвходовые элементы

source: Shifter
ru_ru: Сдвигатель

source: Clock: state updates on trigger
ru_ru: Тактовый вход: состояние обновляется при срабатывании

source: Raise To Top
ru_ru: Поднять наверх

source: View and manipulate the truth table.
ru_ru: Просмотреть и изменять таблицу истинности.

source: AND Gate
ru_ru: Элемент И

source: One
ru_ru: Единица

source: Simulation
ru_ru: Моделирование

source: Output: current value of counter
ru_ru: Выход: текущее значение счётчика

source: Remove Separator
ru_ru: Удалить разделитель

source: (The file is used by the %s library.)
ru_ru: (Файл используется библиотекой %s.)

source: circuit name is missing
ru_ru: отсутствует название схемы

source: Value Invalid
ru_ru: Значение неверно

source: Only one template allowed.
ru_ru: Допускается только один шаблон.

source: Create a new circuit state?
ru_ru: Создать новое состояние схемы?

source: Built-In
ru_ru: Встроенный

source: Could not open template: %s
ru_ru: Невозможно открыть шаблон: %s

source: Exit
ru_ru: Выход

source: Border Only
ru_ru: Только граница

source: XOR Gate
ru_ru: Элемент Исключающее ИЛИ

source: Cut Selection
ru_ru: Вырезать выделение

source: Remove %s
ru_ru: Удалить %s

source: Constant
ru_ru: Константа

source: Gate Output When Undefined
ru_ru: Выход элемента при неопределённости

source: Logisim Documentation
ru_ru: Документация Logisim

source: Russian Translation
ru_ru: Русский перевод

source: Output: the number of 1 bits in the input
ru_ru: Выход: количество битов 1 на входе

source: Component
ru_ru: Компонент

source: Carry Out: the upper bits of the product
ru_ru: Выход переноса: старшие биты произведения

source: Too many inputs for table.
ru_ru: Слишком много входов для таблицы.

source: Recursive
ru_ru: Рекурсивно

source: mouse mapping modifier `%s' invalid
ru_ru: модификатор привязки мыши `%s' неверен

source: Rounded Rectangle
ru_ru: Скруглённый прямоугольник

source: Export
ru_ru: Экспорт

source: The "-load" option can be specified only once.
ru_ru: Параметр "-load" может быть указан только один раз.

source: Store: if 1, store input to memory
ru_ru: Запись: если 1, значение со входа записывается в память

source: Simple
ru_ru: Непосредственно

source: Vertical
ru_ru: Вертикальный

source: Shift Register
ru_ru: Сдвиговый регистр

source: Output: the sum of the inputs (plus carry in)
ru_ru: Выход: сумма значений на входах (плюс значение переноса)

source: S-R Flip-Flop
ru_ru: S-R триггер

source: Contents
ru_ru: Содержимое

source: The JAR file could not be opened.
ru_ru: JAR файл не может быть открыт.

source: Logisim Project (*.circ)
ru_ru: Проект Logisim (*.circ)

source: Drop Components
ru_ru: Сбросить компоненты

source: Number Of Inputs
ru_ru: Количество входов

source: Original Version
ru_ru: Оригинальная версия

source: Borrow In: if 1, 1 is deducted from the output
ru_ru: Вход займа: если 1, то 1 вычитается из выходного значения

source: South
ru_ru: Юг

source: Lead Developer
ru_ru: Ведущий разработчик

source: File output disabled.
ru_ru: Вывод в файл отключен.

source: Circuits:
ru_ru: Схемы:

source: Edit text in circuit
ru_ru: Редактировать текст в схеме

source: Load RAM Image
ru_ru: Загрузка образа ОЗУ

source: File output enabled.
ru_ru: Вывод в файл включен.

source: Expression Not Determined
ru_ru: Выражение не определено

source: Edit
ru_ru: Правка

source: Loading components...
ru_ru: Загрузка компонентов...

source: Revert To Defaults
ru_ru: Вернуть по умолчанию

source: File
ru_ru: Файл

source: Bits %s from combined end
ru_ru: Биты %s с объединённого конца

source: Argument for -gates option must be "shaped" or "rectangular".
ru_ru: Аргумент для параметра -gates должен быть "shaped" или "rectangular".

source: Text
ru_ru: Текст

source: Output: the number of 1 bits in the inputs
ru_ru: Выход: количество битов 1 на входах

source: (empty table)
ru_ru: (пустая таблица)

source: -gates shaped|rectangular use specified gate style
ru_ru: -gates shaped|rectangular использовать указанный стиль элементов

source: Circular
ru_ru: Круглая

source: Bit Finder
ru_ru: Искатель битов
